Конфигурация/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/CommonModules/ПолучениеКурсовВалют/Module.bsl
Процедура РгЗадание() Экспорт
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение("api.nbrb.by", , , , , 30, ЗащищенноеСоединение);

	Запрос = Новый HTTPЗапрос("/exrates/rates?periodicity=0");

	Ответ = Соединение.ВызватьHTTPМетод("GET", Запрос);

	Если Ответ.КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);

		Данные = ПрочитатьJSON(ЧтениеJSON, Истина);

		Для Каждого Значение Из Данные Цикл
			Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			Запись.Валюта = Значение["Cur_Name"];
			Запись.Значение = Значение["Cur_OfficialRate"];
			Запись.Записать();
		КонецЦикла;
	Иначе

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка вызова запроса";
		Сообщение.Сообщить();

	КонецЕсли;
КонецПроцедуры
